In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("emp_name_data.csv")

In [3]:
df

   id   name
0   1   John
1   2   Jane
2   3    Tom
3   4  Alice

In [4]:
df1=pd.read_csv("emp_data_1.csv")

In [5]:
df1

   id      city    country
0   1  New York        USA
1   2    London         UK
2   3     Tokyo      Japan
3   4    Sydney  Australia

In [6]:
merge_df=pd.merge(df,df1,on='id')
merge_df

   id   name      city    country
0   1   John  New York        USA
1   2   Jane    London         UK
2   3    Tom     Tokyo      Japan
3   4  Alice    Sydney  Australia